export default {
  navbar: {
    about: "Обо мне",
    projects: "Проекты",
    certificates: "Сертификаты",
    skills: "Навыки",
    experience: "Опыт",
    testimonials: "Отзывы"
  },
  introduction: {
    greeting: "Привет, я Гарбсон Соуза!",
    role: "Front-End Разработчик",
    cta: "Скачать Резюме"
  },
  biography: {
    title: "Обо мне",
    description: `
    👋 Привет, меня зовут Гарбсон Соуза Сантос, я front-end разработчик, увлеченный созданием интуитивно понятных и отзывчивых
    пользовательских интерфейсов. С крепкой базой в современных технологиях, таких как Vue.js, Quasar, Node.js, Nuxt.js, Vuex и Pinia, я
    превращаю идеи в исключительный цифровой опыт. 💡 С 16 лет я погружаюсь в мир программирования, накопив огромный опыт в проектах на
    фрилансе, охватывающих различные отрасли и географические регионы. Я работал с американской компанией, разрабатывая инновационные
    решения, сотрудничал с биотехнологическими компаниями, а также с отелем в Куско, Перу, всегда сосредотачиваясь на предоставлении
    высококачественных и ценных продуктов. 🌍 В настоящее время я работаю разработчиком в Hellenic Technologies, греческой компании, а также
    в KNN Group, где продолжаю применять и развивать свои навыки. Мой опыт включает использование API для создания мощных и отзывчивых
    веб-приложений, обеспечивая оптимизированную производительность и превосходный пользовательский опыт (UX). 🚀 Наряду с практическим
    опытом, я изучаю Информационные Системы в Федеральном Университете Акри, что позволяет мне совмещать теоретические и практические знания,
    оставаясь в курсе последних тенденций и инноваций на технологическом рынке. 🎓
    `,
  },
  projects: [
    {
      title: "Clube da Luta CT",
      description: "Платформа бойцовского клуба, построенная с использованием современных технологий.",
      img: "CtClube.png",
      firebase: true,
      typescript: true,
      react: true,
      nextjs: true,
      github: "https://github.com/Garbson/grecieCT",
      link: "https://github.com/Garbson/grecieCT",
    },
    {
      title: "Feedel",
      description: "Глобальный маркетплейс, соединяющий продавцов и клиентов по всему миру.",
      img: "feedel.png",
      vue: true,
      Quasar: true,
      node: true,
      nuxt: true,
      github: "https://github.com/hellenictechnologies/feedel-dashboard-garbson",
      link: "https://feedel.app/login",
    },
    {
      title: "Duolingo Clone",
      description: "Интерактивная платформа для изучения языков, вдохновленная Duolingo.",
      img: "duolingo-clone.jpeg",
      vue: true,
      javascript: true,
      bootstrap: true,
      github: "https://github.com/Garbson/duolingo-clone",
      link: "https://duolingo-clone-6jg.pages.dev/exercise/1",
    },
    {
      title: "Wedding Memories",
      description: "Веб-сайт для хранения и обмена памятными моментами в фотографиях.",
      img: "memories.jpeg",
      vue: true,
      typescript: true,
      tailwind: true,
      github: "https://github.com/Garbson/wedding-memories",
      link: "https://wedding-memories.pages.dev/",
    },
    {
      title: "Hostel Pachacuteq",
      description: "Веб-сайт для перуанского отеля, созданный для любителей приключений и комфорта.",
      img: "pachacuteq.png",
      vue: true,
      tailwind: true,
      Quasar: true,
      node: true,
      github: "https://github.com/Garbson/pachacuteq",
      link: "https://pachacuteq.pages.dev/",
    },
    {
      title: "AmazonNanoForest",
      description: "Биотехнологическая инициатива, объединяющая природу и инновации в Амазонии.",
      img: "NanoForest.png",
      vue: true,
      tailwind: true,
      Quasar: true,
      github: "https://github.com/Garbson/AMAZON-NANO-FOREST",
      link: "https://amazonnanoforest.com/",
    },
    {
      title: "Golfim",
      description: "Платформа для предоставления услуг по ремонту и восстановлению бассейнов.",
      img: "Golfim.png",
      vue: true,
      javascript: true,
      Quasar: true,
      github: "https://github.com/leonardo-cordeiro/golfim",
      link: "https://golfim.pages.dev/",
    },
    {
      title: "Crypto Tracker",
      description: "Инструмент для отслеживания ежедневных колебаний криптовалют в реальном времени.",
      img: "Crypto.png",
      vue: true,
      tailwind: true,
      javascript: true,
      firebase: true,
      github: "https://github.com/leonardo-cordeiro/CryptoTracker/tree/Garbson",
      link: "https://cryptotracker-5hk.pages.dev/",
    },
    {
      title: "Калькулятор",
      description: "Простое и функциональное приложение для быстрых расчетов, разработанное с использованием Pinia.",
      img: "Calculadora.png",
      vue: true,
      tailwind: true,
      javascript: true,
      github: "https://github.com/Garbson/calculadora",
      link: "https://calculadora-e7p.pages.dev/",
    },
    {
      title: "To Do List",
      description: "Интуитивно понятный менеджер задач для организации повседневных дел.",
      img: "Todolist.png",
      vue: true,
      tailwind: true,
      javascript: true,
      github: "https://github.com/Garbson/To-do-list",
      link: "https://to-do-list-aky.pages.dev/",
    },
    {
      title: "Brasileiro.ninja",
      description: "Национальная база данных с полезной информацией, такой как индексы, ISBN, DDD и другие.",
      img: "Brasileiro.jpeg",
      vue: true,
      css: true,
      javascript: true,
      github: "https://github.com/arnonrdp/Brasileiro-Ninja",
      link: "https://brasileiro.ninja/",
    },
    {
      title: "Портфолио",
      description: "Мое личное портфолио, демонстрирующее проекты и навыки в области технологий.",
      img: "portfolio.png",
      vue: true,
      tailwind: true,
      javascript: true,
      github: "https://github.com/Garbson/portifolio",
      link: "https://portifolio-by1.pages.dev",
    },
    {
      title: "Температура",
      description: "Приложение для глобальной консультации температуры, простое и удобное.",
      img: "temperatures.jpeg",
      html: true,
      css: true,
      javascript: true,
      github: "https://github.com/Garbson/projeto-site-pra-ver-a-temperatura",
      link: "https://temperature-9ta.pages.dev/",
    },
    {
      title: "Конвертер валют",
      description: "Эффективный инструмент для международного обмена валют.",
      img: "Conversor.jpeg",
      html: true,
      css: true,
      javascript: true,
      github: "https://github.com/Garbson/Currency-Converter",
      link: "https://currency-converter-cgn.pages.dev/",
    },
    {
      title: "Городской пейзаж",
      description: "Интерактивный визуальный опыт при изменении размера окна браузера.",
      img: "city.png",
      html: true,
      css: true,
      javascript: true,
      github: "https://github.com/Garbson/city",
      link: "https://city-du9.pages.dev/",
    },
    {
      title: "Опасные драконы",
      description: "RPG-игра, разработанная на чистом JavaScript.",
      img: "dangerous.png",
      html: true,
      css: true,
      javascript: true,
      github: "https://github.com/Garbson/Dangerous-dragon",
      link: "https://dangerous-dragon.pages.dev/",
    },
  ],
  certificates: {
    title: "Сертификаты",
    items: {
      responsiveWebDesign: "Адаптивный веб-дизайн",
      jsAlgorithms: "Алгоритмы и структуры данных на JavaScript",
      cs50: "CS50: Введение в компьютерные науки",
    },
  },
  skills: {
    title: "Мои Навыки",
    categories: [
      {
        name: "Front-end",
        items: [
          { name: "Vue.js", level: 90, icon: "vue-svgrepo-com.svg", description: "Фреймворк Vue.js для создания интерактивных интерфейсов" },
          { name: "Quasar", level: 85, icon: "Quasar.svg", description: "Фреймворк Quasar для кросс-платформенных Vue приложений" },
          { name: "React", level: 75, icon: "react.svg", description: "Библиотека React.js для создания пользовательских интерфейсов" },
          { name: "Next.js", level: 70, icon: "nextjs.svg", description: "Фреймворк Next.js для React приложений" },
          { name: "Bootstrap", level: 85, icon: "bootstrap.png", description: "Фреймворк CSS Bootstrap для адаптивной веб-разработки" },
          { name: "HTML5", level: 95, icon: "html.svg", description: "Язык разметки HTML5 для веб-контента" },
          { name: "CSS3/SCSS", level: 90, icon: "css-3-svgrepo-com.svg", description: "CSS3 и SCSS для стилизации веб-приложений" },
          { name: "Tailwind CSS", level: 85, icon: "tailwind.svg", description: "Utility-first фреймворк Tailwind CSS" },
          { name: "JavaScript", level: 90, icon: "javascript-svgrepo-com.svg", description: "Язык программирования JavaScript" },
          { name: "TypeScript", level: 80, icon: "typescript.png", description: "TypeScript, надмножество JavaScript с типами" }
        ]
      },
      {
        name: "Back-end и Инструменты",
        items: [
          { name: "Node.js", level: 75, icon: "node.svg", description: "Среда выполнения Node.js для JavaScript" },
          { name: "PHP", level: 70, icon: "php.svg", description: "Язык программирования PHP для веб-разработки" },
          { name: "Python", level: 65, icon: "python.svg", description: "Язык программирования Python для различных целей" },
          { name: "Bash", level: 60, icon: "bash.svg", description: "Скриптовый язык Bash для автоматизации задач" },
          { name: "MySQL", level: 75, icon: "mysql.svg", description: "Система управления реляционными базами данных MySQL" },
          { name: "PostgreSQL", level: 70, icon: "postgresql.svg", description: "Система реляционных баз данных PostgreSQL" },
          { name: "Docker", level: 65, icon: "docker.svg", description: "Платформа контейнеризации Docker" },
          { name: "Firebase", level: 80, icon: "firebase.svg", description: "Платформа Firebase для разработки приложений" },
          { name: "Git/GitHub", level: 85, icon: "github-color-svgrepo-com.svg", description: "Система контроля версий Git и платформа GitHub" },
          { name: "RESTful APIs", level: 85, description: "Проектирование и потребление RESTful API" },
          { name: "Responsive Design", level: 95, description: "Создание адаптивных макетов для всех устройств" },
          { name: "Nuxt.js", level: 75, icon: "nuxt.png", description: "Фреймворк Nuxt.js для Vue приложений" },
          { name: "UI/UX Design", level: 70, description: "Принципы дизайна интерфейса и пользовательского опыта" }
        ]
      }
    ]
  },
  experience: {
    title: "Профессиональный Опыт",
    items: [
      {
        role: "Front-end Разработчик",
        company: "KNN Idiomas Brasil",
        period: "Окт 2024 - Настоящее время",
        description: "В KNN Idiomas Brasil я работаю Front-end разработчиком, в основном используя Vue.js (v2, v3) с Vuetify (v2, v3), а также с REST API."
      },
      {
        role: "Front-end Разработчик",
        company: "Hellenic Technologies",
        period: "Апр 2024 - Настоящее время",
        description: "Разработка с использованием Vue.js и Nuxt.js, интеграция REST API, управление состоянием с помощью Pinia, реализация сложных JavaScript-функциональностей, решение проблем и оптимизация производительности, сотрудничество с дизайнерами и back-end разработчиками для обеспечения высококачественного пользовательского опыта."
      },
      {
        role: "Front-end Разработчик",
        company: "NeuroAEye (Фриланс)",
        period: "Апр 2024 - Авг 2024",
        description: "Разработка с использованием Vue.js, интеграция REST API, JavaScript, Pixi.js для высокопроизводительной 2D-графики и исправление ошибок для оптимизации производительности приложения."
      },
      {
        role: "Front-end Разработчик",
        company: "AmazonNanoForest (Фриланс)",
        period: "2021 - 2023",
        description: "Разработка веб-сайта для биотехнологической компании, создание интуитивно понятных и адаптивных интерфейсов с использованием современных технологий."
      },
      {
        role: "Front-end Разработчик",
        company: "Hostel Pachacuteq (Фриланс)",
        period: "2022",
        description: "Создание веб-сайта для отеля в Куско, Перу, с акцентом на пользовательский опыт и адаптивный дизайн."
      }
    ]
  },
  testimonials: {
    title: "Отзывы",
    items: [
      {
        name: "Arnon Rodrigues de Paula",
        role: "Front-End Expert | Lead Developer | Agile",
        text: "Я рекомендую Гарбсона, талантливого молодого человека, которого я наставлял в последние месяцы. Гарбсон обладает замечательным любопытством и желанием учиться, всегда стремясь развиваться и преодолевать трудности. Он выделяется своими отличными навыками межличностного общения, включая эффективную коммуникацию, эмпатию и способность работать в команде. Его позитивный настрой и готовность помочь другим делают его ценным коллегой. Гарбсон также демонстрирует впечатляющую способность решать проблемы практичным и инновационным способом. Прежде всего, Гарбсон - человек честный и надежный, с образцовой рабочей этикой. Его преданность делу и энтузиазм видны во всем, что он делает."
      },
      {
        name: "Jesiel Monteiro de Oliveira",
        role: "SAFe® 4 Agilist | CSS Senior Specialist at NTT Data | Product Owner",
        text: "Я решительно рекомендую Гарбсона, молодого front-end программиста, чрезвычайно преданного своему делу и обладающего впечатляющей способностью к быстрому обучению. За время нашей совместной работы он продемонстрировал твердые навыки во front-end технологиях, а также невероятную способность эффективно и творчески решать сложные проблемы. Его готовность учиться и адаптироваться к новым вызовам делает его ценным активом для любой команды. С его проактивностью, преданностью делу и постоянным стремлением к совершенствованию, я уверен, что его ждет блестящее будущее в веб-разработке."
      },
      {
        name: "Stavros Tsiogkas",
        role: "Digital Account Manager @ Hellenic Technologies",
        text: "Я рад рекомендовать Гарбсона Соуза, с которым я сотрудничал по многим проектам разработки, особенно на уровне продукта. Техническая экспертиза Гарбсона, инновационное мышление и приверженность к предоставлению высококачественных решений постоянно впечатляли меня. Его способность решать сложные задачи и эффективно работать в команде делает его бесценным ресурсом. Я уверен, что Гарбсон преуспеет в любом начинании, за которое возьмется."
      },
      {
        name: "Gabriel Bodenmüller",
        role: "Software Developer | Python | Vue | JavaScript | Typescript | PostgreSQL | Computer engineer",
        text: "Я имел удовольствие следить за работой Гарбсона и могу с уверенностью сказать: он удивительный профессионал в мире front-end разработки! С острыми навыками в Vue, TypeScript, продвинутом CSS и оптимизации производительности, он не только предоставляет чистый и хорошо структурированный код, но и заботится о пользовательском опыте и удобстве использования продукта. Кроме того, его способность быстро учиться и адаптироваться к новым технологиям впечатляет. Если вы ищете талантливого, коллаборативного и преданного front-end разработчика, Гарбсон - правильный выбор!"
      },
      {
        name: "Tiago Lopes",
        role: "BI Аналитик | Аналитик данных | SQL | BigQuery | Power BI | Looker Studio",
        text: "С большим удовлетворением я рекомендую Гарбсона Соуза для возможностей в качестве Frontend-разработчика. У меня была привилегия работать с ним в KNN Idiomas, где он последовательно демонстрировал свои технические навыки и приверженность к высококачественным результатам. Гарбсон - талантливый профессионал, знающий такие технологии, как Vue.js, Quasar, Vuex/Pinia, Node.js, JavaScript, Nuxt.js, REST API, Vuetify и TypeScript. Его способность создавать современные, интуитивно понятные и эффективные интерфейсы заметна, помимо его умения интегрировать сложные системы с REST API. За время нашей совместной работы Гарбсон выделялся своим совместным подходом и решением проблем."
      }
    ]
  }
};